template/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    surfaceToCell
    {
	name	lake;
	file	"./constant/triSurface/lake_box.stl";
	filetype stl;
	outsidePoints
	(
		(120958 120370 4550)
	);
	includeCut	true;  //das koennte auch auf false gestellt werden
	includeInside	true;
	includeOutside	false;
	nearDistance	-1;
	curvature	-100;
        fieldValues
        (
            volScalarFieldValue alpha.water 1.0
        );
    }
);


// ************************************************************************* //
