template/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /   F ield        | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /    O peration    | Version:  v2112                                 |
|   \\  /     A nd          | Website:                                        |
|    \\/      M anipulation |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2012;
    format          ascii;
    class           dictionary;
    location        "system";
    object          topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
    name    baffleFaceSet;
    type    faceSet;
    action  new;
    source  boxToFace;
    box     (120957 120456 4442) (120959 120545 4530);
    }

    {
    name    baffleFaceZone;
    type    faceZoneSet;
    action  new;
    
    source  setToFaceZone;
    sourceInfo
        {
            faceSet baffleFaceSet;
        }
    }
);


// ************************************************************************* //
